
/*******************************************************************************
 * INCLUDES
 */

/*******************************************************************************
 * DEBUG SWITCH MACROS
 */


/*******************************************************************************
 * MACROS
 */

/*******************************************************************************
 * TYPEDEFS
 */
typedef enum {
    DRIVE_MOD_REAR = 0,                 //ºóÇý
    DRIVE_MOD_DOUBLE,                   //Ë«Çý  
    DRIVE_MOD_FRONT,                    //Ç°Çý 
}drive_mode_;
/*******************************************************************************
 * CONSTANTS
 */

/*******************************************************************************
 * LOCAL FUNCTIONS DECLEAR
 */

/*******************************************************************************
 * GLOBAL VARIABLES
 */


/*******************************************************************************
 * STATIC VARIABLES
 */

/*******************************************************************************
 * EXTERNAL VARIABLES
 */

void task_lhl2_ptl_init_running(void);
void task_lhl2_ptl_start_running(void);
void task_lhl2_ptl_assert_running(void);
void task_lhl2_ptl_running(void);
void task_lhl2_ptl_post_running(void);
void task_lhl2_ptl_stop_running(void);

